rottenpotatoes/app/controllers/movies_controller.rb

  def create
    @movie = Movie.create!(movie_params)
---
INSERT INTO "movies" ("title", "director", "rating", "description", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def similar
    movie = Movie.find(params[:movie_id])

    @similar_movies = Movie
                        .where('id != ? AND director = ?', params[:movie_id], movie.director)
---
SELECT "movies".* FROM "movies" WHERE (id != '1' AND director = 'George Lucas')
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]